``` random_id.beacon-volume_name_unique: Refreshing state... [id=30y90GVAkNE]
random_id.gpu-node-alpha-volume_name_unique: Refreshing state... [id=SPHgcjPS6Lg]
random_id.berenice-volume_name_unique: Refreshing state... [id=cydIZsSoY0Q]
random_id.pavan-volume_name_unique: Refreshing state... [id=w1skFqvuMLo]
openstack_compute_keypair_v2.jenkins2: Refreshing state... [id=jenkins2]
openstack_blockstorage_volume_v2.gpu-node-alpha-vol: Refreshing state... [id=f36ad02f-dfe4-4bc6-9ea1-6e56344bbcbc]
openstack_compute_instance_v2.jenkins-workers-silver[0]: Refreshing state... [id=33c64afb-9cd0-49e1-9ced-9cecb973aa05]
openstack_blockstorage_volume_v2.cvmfs-data-eu: Refreshing state... [id=b637697c-5227-4b0c-a300-7afdd2256cc4]
openstack_blockstorage_volume_v2.jenkins-workers-silver-volume[0]: Refreshing state... [id=5a8009f3-4007-45f1-98eb-50634d8dbc51]
openstack_networking_secgroup_v2.public-onedata: Refreshing state... [id=e5485716-3382-42f8-91f3-4089ed13a261]
openstack_compute_instance_v2.incoming: Refreshing state... [id=33e2e7ad-9d94-4fc8-bfa7-9b8a5d1a480b]
openstack_blockstorage_volume_v2.berenice-vol: Refreshing state... [id=f831b575-254e-4f55-a820-b43da83c9498]
openstack_blockstorage_volume_v2.beacon-vol: Refreshing state... [id=e0a79fc1-897e-49da-b7bb-44a13ad9984e]
openstack_networking_secgroup_v2.public-ftp: Refreshing state... [id=a88a8353-06e7-4004-b5af-3cdfe4538885]
openstack_networking_secgroup_v2.public-irods: Refreshing state... [id=76c1626a-4c0d-4277-bb01-1820f1351b36]
openstack_compute_instance_v2.dokku: Refreshing state... [id=030ea6f7-ad95-441f-8cdc-89ff10af062e]
openstack_compute_instance_v2.jenkins-workers-gold[0]: Refreshing state... [id=2e9cae02-78e0-43cf-bc71-14331a8f1147]
openstack_blockstorage_volume_v2.pavan-vol: Refreshing state... [id=29f5665f-70c0-4fff-a804-9d00d425830e]
openstack_compute_keypair_v2.cloud2: Refreshing state... [id=cloud2]
openstack_networking_secgroup_v2.egress: Refreshing state... [id=4ce0dafb-f4e4-40a8-8bfc-2af973d6a100]
openstack_networking_secgroup_v2.public-amqp: Refreshing state... [id=43bc7abb-e1e7-4117-b98c-65a435499cf9]
openstack_networking_secgroup_v2.public-ssh: Refreshing state... [id=c6e3a35d-73d4-4819-871e-d0a13669f965]
openstack_networking_secgroup_v2.public-influxdb: Refreshing state... [id=7f144506-09fe-4555-84b2-d2607ee32451]
openstack_networking_secgroup_v2.ufr-ingress: Refreshing state... [id=6d200906-faa9-413f-8aca-144414ebc639]
openstack_blockstorage_volume_v2.grafana-data: Refreshing state... [id=ad56f01f-cb21-458c-b1f9-90f937aa6525]
openstack_compute_instance_v2.test-galaxy: Refreshing state... [id=e0cbbc17-e62e-4fde-944e-422b25e8d2a4]
openstack_compute_instance_v2.grafana: Refreshing state... [id=1445509e-bda3-4c8c-b0c1-12f6000c6e69]
openstack_blockstorage_volume_v2.influxdb-data: Refreshing state... [id=f6e77471-9180-4055-941f-b18fe353571c]
openstack_blockstorage_volume_v2.jenkins-workers-bronze-volume[0]: Refreshing state... [id=2a592bbd-cf73-4739-87dd-5addbdcdf793]
openstack_compute_instance_v2.influxdb-usegalaxy: Refreshing state... [id=2a184502-cdd0-445f-b259-a8219d3d3045]
openstack_compute_instance_v2.cvmfs1-ufr0-eu: Refreshing state... [id=0ce4f15c-0978-4447-b219-7998c311e239]
openstack_networking_secgroup_v2.public-web2: Refreshing state... [id=a27ba641-5250-47ce-a3c7-24ab797a3698]
openstack_blockstorage_volume_v2.jenkins-workers-gold-volume[0]: Refreshing state... [id=8db29e86-cb8c-451d-a2f0-a5b02332ba3e]
openstack_networking_secgroup_v2.public-onedata2: Refreshing state... [id=c5378dbb-36aa-45cb-aec9-e20bb95d7e3a]
openstack_compute_instance_v2.proxy: Refreshing state... [id=d0909795-ebe8-426f-9097-a0c30a21a455]
openstack_compute_instance_v2.jenkins-workers-bronze[0]: Refreshing state... [id=d5b12544-f6a9-45eb-8076-989f981c5cec]
openstack_compute_keypair_v2.cloud3: Refreshing state... [id=cloud3]
openstack_compute_instance_v2.cvmfs-stratum0-eu: Refreshing state... [id=821ee59b-8dde-4987-b89c-0b929f0036cb]
openstack_compute_instance_v2.mq-instance: Refreshing state... [id=b7c1deb8-ba96-49e7-a5c3-81c46c32334c]
openstack_networking_secgroup_v2.public-ping: Refreshing state... [id=ca640c0b-9d65-4486-bdfd-72efc77e3fa7]
openstack_compute_instance_v2.beacon-import: Refreshing state... [id=d2748639-864c-46a3-940d-ce69e5b6c8ce]
openstack_compute_instance_v2.gpu-node-alpha: Refreshing state... [id=f4689893-d0c9-4554-bc1e-ffebdd1a4008]
openstack_networking_secgroup_rule_v2.public-onedata-ports6[1]: Refreshing state... [id=88fb891b-e6b8-4971-a4ad-35a79b2bebf9]
openstack_networking_secgroup_rule_v2.public-onedata-ports6[3]: Refreshing state... [id=91dba608-ec0b-48ea-b4f1-0a6797c551c4]
openstack_networking_secgroup_rule_v2.public-onedata-ports6[0]: Refreshing state... [id=0f9ca7af-a58d-4893-80d2-4f60cb895c64]
openstack_networking_secgroup_rule_v2.public-onedata-ports6[2]: Refreshing state... [id=a6b42ecf-a1bb-4e57-9586-fedba047a840]
openstack_networking_secgroup_rule_v2.public-onedata-udp-ports4[0]: Refreshing state... [id=45157aec-9dca-425c-bfbb-cb3de45af386]
openstack_networking_secgroup_rule_v2.public-onedata-ports4[1]: Refreshing state... [id=00b3bde2-7325-4e08-8163-fc48179fdb5b]
openstack_networking_secgroup_rule_v2.public-onedata-ports4[0]: Refreshing state... [id=a7769a80-33cb-467e-b96f-a93180fa6b5a]
openstack_networking_secgroup_rule_v2.public-onedata-ports4[2]: Refreshing state... [id=5464591b-61b3-44bb-ba23-e592b8958b50]
openstack_networking_secgroup_rule_v2.public-onedata-ports4[3]: Refreshing state... [id=b47129c3-8a4e-49c5-b068-136a7c9516a9]
openstack_networking_secgroup_rule_v2.public-onedata-udp-ports6[0]: Refreshing state... [id=59e4b9ae-ca47-4fae-a456-65690952d330]
openstack_networking_secgroup_rule_v2.public-ftp-ingress-ip4: Refreshing state... [id=617f8dc6-a801-4b1d-9fea-1d014bc36ff1]
openstack_networking_secgroup_rule_v2.public-ftp-data-ports-ipv6: Refreshing state... [id=153ff827-afab-46df-8bdf-fb1f7b606e5b]
openstack_networking_secgroup_rule_v2.public-ftp-ingress-ipv4: Refreshing state... [id=97f19dc9-b56b-47b1-af30-37df5db6725d]
openstack_networking_secgroup_rule_v2.public-ftp-egress-ipv4: Refreshing state... [id=89927236-3f46-4c98-88b1-df828e0d5814]
openstack_networking_secgroup_rule_v2.public-ftp-data-ports-ipv4: Refreshing state... [id=984bf266-05fa-491a-9612-d67388bed57b]
openstack_networking_secgroup_rule_v2.public-ftp-egress-ipv6: Refreshing state... [id=2514be15-92ca-4f45-b481-cd6af21d8285]
openstack_networking_secgroup_rule_v2.zone_port-4c32276f-f8b6-45d0-b9aa-8458fe162ba3: Refreshing state... [id=9c80dbe3-380c-4e6b-8cf1-2d32963fad3a]
openstack_networking_secgroup_rule_v2.zone_port-9230b66f-e769-407e-a11f-52b37ebc6b30: Refreshing state... [id=fb03ed70-c83e-4bdc-b97e-4d20b9d2f009]
openstack_compute_instance_v2.maintenance: Refreshing state... [id=b4683dc8-97b5-4351-b009-557afd4e88a4]
openstack_compute_instance_v2.beacon: Refreshing state... [id=7ce99c35-e903-4b7e-b47d-9c4bbfbbdbc9]
openstack_compute_instance_v2.upload: Refreshing state... [id=8fac68f2-7259-419d-8fa3-b70d8bef594f]
openstack_compute_instance_v2.celery[0]: Refreshing state... [id=cbf3415b-25bb-4e44-b1b1-01cc9ea1400b]
openstack_networking_secgroup_rule_v2.egress-ports4: Refreshing state... [id=b1735150-05ed-48da-a260-ef7d50454038]
openstack_networking_secgroup_rule_v2.egress-ports6: Refreshing state... [id=3c894b67-42eb-4b00-922d-0dec1ca27505]
openstack_networking_secgroup_rule_v2.public-amqp-5671: Refreshing state... [id=2a2fb08b-6512-4d42-b239-cdfa132ebef6]
openstack_networking_secgroup_rule_v2.ssh_69bda1a1-67d2-4999-b14a-573ead46073c: Refreshing state... [id=0088f738-fbdf-478d-858b-f5b095948bff]
openstack_networking_secgroup_rule_v2.ssh_aa57e62d-6644-40fb-ad6f-05b50e14bb54: Refreshing state... [id=7e35fdf3-36f1-4d4a-be7f-3771b920c003]
openstack_networking_secgroup_rule_v2.public-influxdb-rule: Refreshing state... [id=c0e7618e-c309-4c22-8b5c-d180fec9af4f]
openstack_networking_secgroup_rule_v2.ufr-ingress-9725f501-278c-4286-9cae-3ec20d89c724: Refreshing state... [id=207ad7ef-356a-4644-b36f-1ea9221f5f41]
openstack_networking_secgroup_rule_v2.ufr-ingress-58293ee9-af20-4f46-8fb2-8760afb10f9a: Refreshing state... [id=62ab1a32-5c59-419f-95dd-ecc07225208e]
openstack_networking_secgroup_rule_v2.ufr-ingress-40047dc3-cf90-4d66-ade4-5c281ea03a9c: Refreshing state... [id=f0c0a022-a95f-433b-b2b1-b8d63fb8cb89]
openstack_networking_secgroup_rule_v2.ufr-ingress-de4ad9ea-9ee4-4a8c-88ee-cc14410ebada: Refreshing state... [id=fcaa919a-d06d-4e5c-8698-0c188a5d5511]
openstack_compute_instance_v2.ryan: Refreshing state... [id=02ea13aa-c849-488c-bc79-e1cef8fdd558]
openstack_compute_instance_v2.pavan: Refreshing state... [id=6f139c40-1654-4eb6-a9c7-d92fc134e2c1]
openstack_compute_instance_v2.berenice: Refreshing state... [id=286b7357-5195-4e67-9b25-39bd957beb3d]
openstack_compute_instance_v2.student-hollers: Refreshing state... [id=a4561e20-b68a-4338-93d1-6faf43317ffd]
openstack_networking_secgroup_rule_v2.public-web2-ports4[0]: Refreshing state... [id=d37b28fa-cbb7-41a5-ad0e-b89beb641083]
openstack_networking_secgroup_rule_v2.public-web2-ports4[1]: Refreshing state... [id=bd8797e2-1232-4da0-bada-47b4c6a01457]
openstack_networking_secgroup_rule_v2.public-web2-ports4[2]: Refreshing state... [id=e1611ace-4326-4c99-84ee-d08de9e7839e]
openstack_networking_secgroup_rule_v2.public-web2-ports6[0]: Refreshing state... [id=4c64f413-9afb-4d10-b4a9-2a15edb0e8f4]
openstack_networking_secgroup_rule_v2.public-web2-ports6[1]: Refreshing state... [id=ab300c67-adb0-47fc-a739-4d3cca6c5be0]
openstack_networking_secgroup_rule_v2.public-web2-ports6[2]: Refreshing state... [id=675008b4-8584-4ef0-b21b-07e161853374]
random_pet.training-vm-eu[0]: Refreshing state... [id=exact-beagle]
random_pet.training-vm-eu[1]: Refreshing state... [id=proper-polecat]
openstack_networking_secgroup_rule_v2.public-onedata2-ports6[3]: Refreshing state... [id=5220e46b-e94f-4e37-9392-a381ca018203]
openstack_networking_secgroup_rule_v2.public-onedata2-ports4[1]: Refreshing state... [id=fa8dbb12-6751-4387-b207-fa0530440904]
openstack_networking_secgroup_rule_v2.public-onedata2-ports6[4]: Refreshing state... [id=b42c9387-018e-420a-af18-d3e234e14e29]
openstack_networking_secgroup_rule_v2.public-onedata2-ports6[0]: Refreshing state... [id=18a8fce9-0289-4bfd-b148-c5ab131ed882]
openstack_networking_secgroup_rule_v2.public-onedata2-ports6[1]: Refreshing state... [id=2965c276-dce6-4ff3-848d-7403c5e13f61]
openstack_networking_secgroup_rule_v2.public-onedata2-ports6[2]: Refreshing state... [id=1fd70c9c-b4c2-4e30-af2d-343adb8377ee]
openstack_compute_volume_attach_v2.jenkins-workers-silver-va[0]: Refreshing state... [id=33c64afb-9cd0-49e1-9ced-9cecb973aa05/5a8009f3-4007-45f1-98eb-50634d8dbc51]
openstack_networking_secgroup_rule_v2.public-onedata2-ports4[2]: Refreshing state... [id=988a8c04-3e81-4957-b310-3bb9d9734bde]
openstack_networking_secgroup_rule_v2.public-onedata2-ports4[3]: Refreshing state... [id=42fba4d8-fa10-477b-851f-7c2761691c8c]
openstack_networking_secgroup_rule_v2.public-onedata2-ports4[4]: Refreshing state... [id=58a37bda-05aa-4c82-8230-35a095b19d7e]
openstack_networking_secgroup_rule_v2.public-onedata2-ports4[0]: Refreshing state... [id=74abcabb-5c2d-4fc2-8a56-e713939f7e08]
openstack_networking_secgroup_rule_v2.public-ping-b650820a-0a7e-4ba8-ba2b-f14656b9388d: Refreshing state... [id=030a444e-0cfb-4aed-9e7b-400a7cd7a547]
openstack_compute_volume_attach_v2.jenkins-workers-gold-va[0]: Refreshing state... [id=2e9cae02-78e0-43cf-bc71-14331a8f1147/8db29e86-cb8c-451d-a2f0-a5b02332ba3e]
openstack_compute_instance_v2.dev: Refreshing state... [id=f4cc727a-d503-421e-8dca-e0090ba4a4f6]
openstack_compute_volume_attach_v2.stats-va: Refreshing state... [id=1445509e-bda3-4c8c-b0c1-12f6000c6e69/ad56f01f-cb21-458c-b1f9-90f937aa6525]
openstack_compute_volume_attach_v2.influxdb-va: Refreshing state... [id=2a184502-cdd0-445f-b259-a8219d3d3045/f6e77471-9180-4055-941f-b18fe353571c]
openstack_compute_volume_attach_v2.jenkins-workers-bronze-va[0]: Refreshing state... [id=d5b12544-f6a9-45eb-8076-989f981c5cec/2a592bbd-cf73-4739-87dd-5addbdcdf793]
openstack_compute_volume_attach_v2.cvmfs-va-eu: Refreshing state... [id=821ee59b-8dde-4987-b89c-0b929f0036cb/b637697c-5227-4b0c-a300-7afdd2256cc4]
openstack_compute_volume_attach_v2.gpu-node-alpha-internal-va: Refreshing state... [id=f4689893-d0c9-4554-bc1e-ffebdd1a4008/f36ad02f-dfe4-4bc6-9ea1-6e56344bbcbc]
openstack_compute_volume_attach_v2.beacon-va: Refreshing state... [id=7ce99c35-e903-4b7e-b47d-9c4bbfbbdbc9/e0a79fc1-897e-49da-b7bb-44a13ad9984e]
openstack_compute_instance_v2.training-vm-eu[0]: Refreshing state... [id=83412041-7563-431d-8cd7-8d1a7627fb00]
openstack_compute_instance_v2.training-vm-eu[1]: Refreshing state... [id=9b38a84f-027d-4c2a-9465-03c85cee113e]
openstack_compute_volume_attach_v2.berenice-va: Refreshing state... [id=286b7357-5195-4e67-9b25-39bd957beb3d/f831b575-254e-4f55-a820-b43da83c9498]
aws_route53_record.test-galaxy: Refreshing state... [id=Z1C7L7XFF9613J_test.internal.usegalaxy.eu_A]
aws_route53_record.cm-galaxyproject: Refreshing state... [id=Z386N8B8JBC6TQ_condor-cm.galaxyproject.eu_CNAME]
aws_route53_record.influxdb-usegalaxy-internal: Refreshing state... [id=Z386N8B8JBC6TQ_influxdb.galaxyproject.eu_A]
aws_route53_record.gpunodealpha: Refreshing state... [id=Z386N8B8JBC6TQ_gpu-node-alpha.galaxyproject.eu_A]
aws_route53_record.jenkins-workers-silver[0]: Refreshing state... [id=Z386N8B8JBC6TQ_worker-0.silver.build.galaxyproject.eu_A]
aws_route53_record.grafana-usegalaxy: Refreshing state... [id=Z386N8B8JBC6TQ_stats.galaxyproject.eu_A]
aws_route53_record.zfs3f-galaxyproject: Refreshing state... [id=Z386N8B8JBC6TQ_zfs3f.galaxyproject.eu_A]
aws_route53_record.maintenance-galaxyproject: Refreshing state... [id=Z386N8B8JBC6TQ_maintenance.galaxyproject.eu_A]
aws_route53_record.sn05-galaxyproject: Refreshing state... [id=Z386N8B8JBC6TQ_sn05.galaxyproject.eu_A]
aws_route53_record.subdomain-internal[0]: Refreshing state... [id=Z386N8B8JBC6TQ_cvmfs1-ufr0.galaxyproject.eu_CNAME]
aws_route53_record.cvmfs1-ufr0-eu: Refreshing state... [id=Z386N8B8JBC6TQ_cvmfs1-ufr0.internal.galaxyproject.eu_A]
aws_route53_record.jenkins-workers-gold[0]: Refreshing state... [id=Z386N8B8JBC6TQ_worker-0.gold.build.galaxyproject.eu_A]
aws_route53_record.sn07-galaxyproject: Refreshing state... [id=Z386N8B8JBC6TQ_sn07.galaxyproject.eu_A]
aws_route53_record.incoming: Refreshing state... [id=Z386N8B8JBC6TQ_incoming.galaxyproject.eu_A]
aws_route53_record.upload-galaxyproject: Refreshing state... [id=Z386N8B8JBC6TQ_upload.galaxyproject.eu_A]
aws_route53_record.build-usegalaxy: Refreshing state... [id=Z386N8B8JBC6TQ_build.galaxyproject.eu_A]
aws_route53_record.ssds1-galaxyproject: Refreshing state... [id=Z386N8B8JBC6TQ_zfs0f.galaxyproject.eu_A]
aws_route53_record.dokku-dns-wildcard: Refreshing state... [id=Z386N8B8JBC6TQ_*.apps.galaxyproject.eu_CNAME]
aws_route53_record.proxy-internal: Refreshing state... [id=Z386N8B8JBC6TQ_proxy.internal.galaxyproject.eu_A]
aws_route53_record.plausible: Refreshing state... [id=Z386N8B8JBC6TQ_plausible.galaxyproject.eu_A]
aws_route53_record.cvmfs-stratum0-eu: Refreshing state... [id=Z386N8B8JBC6TQ_cvmfs-stratum0.galaxyproject.eu_A]
aws_route53_record.zfs1-galaxyproject: Refreshing state... [id=Z386N8B8JBC6TQ_zfs1.galaxyproject.eu_A]
aws_route53_record.dokku-dns: Refreshing state... [id=Z386N8B8JBC6TQ_apps.galaxyproject.eu_A]
aws_route53_record.jenkins-workers-bronze[0]: Refreshing state... [id=Z386N8B8JBC6TQ_worker-0.bronze.build.galaxyproject.eu_A]
aws_route53_record.beacon-import-galaxyproject: Refreshing state... [id=Z386N8B8JBC6TQ_beacon-import.galaxyproject.eu_A]
aws_route53_record.mq-instance: Refreshing state... [id=Z386N8B8JBC6TQ_mq.galaxyproject.eu_A]
aws_route53_record.sn06-galaxyproject: Refreshing state... [id=Z386N8B8JBC6TQ_sn06.galaxyproject.eu_A]
aws_route53_record.ftp: Refreshing state... [id=Z1C7L7XFF9613J_ftp.usegalaxy.eu_A]
aws_route53_record.usegalaxy-eu: Refreshing state... [id=Z1C7L7XFF9613J_usegalaxy.eu_A]
aws_route53_record.celery-galaxyproject[0]: Refreshing state... [id=Z386N8B8JBC6TQ_celery-0.galaxyproject.eu_A]
aws_route53_record.zfs2f-galaxyproject: Refreshing state... [id=Z386N8B8JBC6TQ_zfs2f.galaxyproject.eu_A]
aws_route53_record.apollo-main: Refreshing state... [id=Z386N8B8JBC6TQ_apollo.internal.galaxyproject.eu_A]
aws_route53_record.subdomains[35]: Refreshing state... [id=Z1C7L7XFF9613J_materials.usegalaxy.eu_CNAME]
aws_route53_record.beacon-galaxyproject: Refreshing state... [id=Z386N8B8JBC6TQ_beacon.galaxyproject.eu_A]
aws_route53_record.subdomains[15]: Refreshing state... [id=Z1C7L7XFF9613J_singlecell.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[20]: Refreshing state... [id=Z1C7L7XFF9613J_annotation.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[17]: Refreshing state... [id=Z1C7L7XFF9613J_nanopore.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[22]: Refreshing state... [id=Z1C7L7XFF9613J_live.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[5]: Refreshing state... [id=Z1C7L7XFF9613J_stats.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[3]: Refreshing state... [id=Z1C7L7XFF9613J_rna.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[30]: Refreshing state... [id=Z1C7L7XFF9613J_cancer.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[36]: Refreshing state... [id=Z1C7L7XFF9613J_phage.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[6]: Refreshing state... [id=Z1C7L7XFF9613J_beta.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[18]: Refreshing state... [id=Z1C7L7XFF9613J_metabolomics.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[19]: Refreshing state... [id=Z1C7L7XFF9613J_humancellatlas.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[4]: Refreshing state... [id=Z1C7L7XFF9613J_build.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[9]: Refreshing state... [id=Z1C7L7XFF9613J_test.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[21]: Refreshing state... [id=Z1C7L7XFF9613J_erasmusmc.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[23]: Refreshing state... [id=Z1C7L7XFF9613J_plants.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[2]: Refreshing state... [id=Z1C7L7XFF9613J_metagenomics.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[27]: Refreshing state... [id=Z1C7L7XFF9613J_covid19.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[1]: Refreshing state... [id=Z1C7L7XFF9613J_hicexplorer.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[33]: Refreshing state... [id=Z1C7L7XFF9613J_microgalaxy.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[34]: Refreshing state... [id=Z1C7L7XFF9613J_spatialomics.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[0]: Refreshing state... [id=Z1C7L7XFF9613J_ecology.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[24]: Refreshing state... [id=Z1C7L7XFF9613J_lite.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[14]: Refreshing state... [id=Z1C7L7XFF9613J_imaging.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[25]: Refreshing state... [id=Z1C7L7XFF9613J_ml.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[28]: Refreshing state... [id=Z1C7L7XFF9613J_africa.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[29]: Refreshing state... [id=Z1C7L7XFF9613J_microbiome.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[26]: Refreshing state... [id=Z1C7L7XFF9613J_virology.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[8]: Refreshing state... [id=Z1C7L7XFF9613J_clipseq.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[12]: Refreshing state... [id=Z1C7L7XFF9613J_graphclust.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[31]: Refreshing state... [id=Z1C7L7XFF9613J_assembly.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[11]: Refreshing state... [id=Z1C7L7XFF9613J_streetscience.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[32]: Refreshing state... [id=Z1C7L7XFF9613J_india.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[16]: Refreshing state... [id=Z1C7L7XFF9613J_climate.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[13]: Refreshing state... [id=Z1C7L7XFF9613J_cheminformatics.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[7]: Refreshing state... [id=Z1C7L7XFF9613J_proteomics.usegalaxy.eu_CNAME]
aws_route53_record.subdomains[10]: Refreshing state... [id=Z1C7L7XFF9613J_old.usegalaxy.eu_CNAME]
aws_route53_record.proxy: Refreshing state... [id=Z386N8B8JBC6TQ_proxy.galaxyproject.eu_A]
aws_route53_record.galaxyproject-eu: Refreshing state... [id=Z386N8B8JBC6TQ_galaxyproject.eu_A]
openstack_compute_volume_attach_v2.pavan-va: Refreshing state... [id=6f139c40-1654-4eb6-a9c7-d92fc134e2c1/29f5665f-70c0-4fff-a804-9d00d425830e]
aws_route53_record.training-vm-eu[0]: Refreshing state... [id=Z05016927AMHTHGB1IS2_gat-0.eu.training.galaxyproject.eu_A]
aws_route53_record.training-vm-eu[1]: Refreshing state... [id=Z05016927AMHTHGB1IS2_gat-1.eu.training.galaxyproject.eu_A]

Note: Objects have changed outside of Terraform
Note: Objects have changed outside of Terraform


Terraform detected the following changes made outside of Terraform since the
Terraform detected the following changes made outside of Terraform since the
last "terraform apply":
last "terraform apply":


  # openstack_compute_instance_v2.maintenance has changed
  # openstack_compute_instance_v2.maintenance has changed
  ~ resource "openstack_compute_instance_v2" "maintenance" {
  ~ resource "openstack_compute_instance_v2" "maintenance" {
        id                  = "b4683dc8-97b5-4351-b009-557afd4e88a4"
        id                  = "b4683dc8-97b5-4351-b009-557afd4e88a4"
        name                = "maintenance.galaxyproject.eu"
        name                = "maintenance.galaxyproject.eu"
      + tags                = []
      + tags                = []
        # (14 unchanged attributes hidden)
        # (14 unchanged attributes hidden)




        # (2 unchanged blocks hidden)
        # (2 unchanged blocks hidden)
    }
    }


  # openstack_compute_instance_v2.test-galaxy has changed
  # openstack_compute_instance_v2.test-galaxy has changed
  ~ resource "openstack_compute_instance_v2" "test-galaxy" {
  ~ resource "openstack_compute_instance_v2" "test-galaxy" {
        id                  = "e0cbbc17-e62e-4fde-944e-422b25e8d2a4"
        id                  = "e0cbbc17-e62e-4fde-944e-422b25e8d2a4"
        name                = "test.internal.usegalaxy.eu"
        name                = "test.internal.usegalaxy.eu"
      ~ security_groups     = [
      ~ security_groups     = [
          + "Condor10",
          + "Condor10",
            # (4 unchanged elements hidden)
            # (4 unchanged elements hidden)
        ]
        ]
        tags                = []
        tags                = []
        # (12 unchanged attributes hidden)
        # (12 unchanged attributes hidden)




        # (2 unchanged blocks hidden)
        # (2 unchanged blocks hidden)
    }
    }




Unless you have made equivalent changes to your configuration, or ignored the
Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
actions to undo or respond to these changes.


─────────────────────────────────────────────────────────────────────────────
─────────────────────────────────────────────────────────────────────────────


Terraform used the selected providers to generate the following execution
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  ~ update in-place
-/+ destroy and then create replacement
-/+ destroy and then create replacement


Terraform will perform the following actions:
Terraform will perform the following actions:


  # aws_route53_record.maintenance-galaxyproject will be updated in-place
  # aws_route53_record.maintenance-galaxyproject will be updated in-place
  ~ resource "aws_route53_record" "maintenance-galaxyproject" {
  ~ resource "aws_route53_record" "maintenance-galaxyproject" {
        id              = "Z386N8B8JBC6TQ_maintenance.galaxyproject.eu_A"
        id              = "Z386N8B8JBC6TQ_maintenance.galaxyproject.eu_A"
        name            = "maintenance.galaxyproject.eu"
        name            = "maintenance.galaxyproject.eu"
      ~ records         = [
      ~ records         = [
          - "10.5.68.118",
          - "10.5.68.118",
        ] -> (known after apply)
        ] -> (known after apply)
        # (5 unchanged attributes hidden)
        # (5 unchanged attributes hidden)
    }
    }


  # openstack_compute_instance_v2.maintenance must be replaced
  # openstack_compute_instance_v2.maintenance must be replaced
-/+ resource "openstack_compute_instance_v2" "maintenance" {
-/+ resource "openstack_compute_instance_v2" "maintenance" {
      ~ access_ip_v4        = "10.5.68.118" -> (known after apply)
      ~ access_ip_v4        = "10.5.68.118" -> (known after apply)
      + access_ip_v6        = (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "d324e8d9-8a15-4a54-ae60-440767bbab53" -> (known after apply)
      ~ flavor_id           = "d324e8d9-8a15-4a54-ae60-440767bbab53" -> (known after apply)
      ~ id                  = "b4683dc8-97b5-4351-b009-557afd4e88a4" -> (known after apply)
      ~ id                  = "b4683dc8-97b5-4351-b009-557afd4e88a4" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> "c6906a58-1e05-4be0-8f20-41f24c8320b5" # forces replacement
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> "c6906a58-1e05-4be0-8f20-41f24c8320b5" # forces replacement
      + image_name          = (known after apply)
      + image_name          = (known after apply)
        name                = "maintenance.galaxyproject.eu"
        name                = "maintenance.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
      - tags                = [] -> null
        # (7 unchanged attributes hidden)
        # (7 unchanged attributes hidden)


      ~ block_device {
      ~ block_device {
            # (6 unchanged attributes hidden)
            # (6 unchanged attributes hidden)
        }
        }


      ~ network {
      ~ network {
          ~ fixed_ip_v4    = "10.5.68.118" -> (known after apply)
          ~ fixed_ip_v4    = "10.5.68.118" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:e3:89:d9" -> (known after apply)
          ~ mac            = "fa:16:3e:e3:89:d9" -> (known after apply)
            name           = "bioinf"
            name           = "bioinf"
          + port           = (known after apply)
          + port           = (known after apply)
          ~ uuid           = "7de249b6-6d32-44e3-b50c-291939868d2f" -> (known after apply)
          ~ uuid           = "7de249b6-6d32-44e3-b50c-291939868d2f" -> (known after apply)
            # (1 unchanged attribute hidden)
            # (1 unchanged attribute hidden)
        }
        }
    }
    }


  # openstack_compute_instance_v2.test-galaxy will be updated in-place
  # openstack_compute_instance_v2.test-galaxy will be updated in-place
  ~ resource "openstack_compute_instance_v2" "test-galaxy" {
  ~ resource "openstack_compute_instance_v2" "test-galaxy" {
        id                  = "e0cbbc17-e62e-4fde-944e-422b25e8d2a4"
        id                  = "e0cbbc17-e62e-4fde-944e-422b25e8d2a4"
        name                = "test.internal.usegalaxy.eu"
        name                = "test.internal.usegalaxy.eu"
      ~ security_groups     = [
      ~ security_groups     = [
          - "Condor10",
          - "Condor10",
            # (4 unchanged elements hidden)
            # (4 unchanged elements hidden)
        ]
        ]
        tags                = []
        tags                = []
        # (12 unchanged attributes hidden)
        # (12 unchanged attributes hidden)




        # (2 unchanged blocks hidden)
        # (2 unchanged blocks hidden)
    }
    }


Plan: 1 to add, 2 to change, 1 to destroy.
Plan: 1 to add, 2 to change, 1 to destroy.


─────────────────────────────────────────────────────────────────────────────
─────────────────────────────────────────────────────────────────────────────


Saved the plan to: tf.plan
Saved the plan to: tf.plan


To perform exactly these actions, run the following command to apply:
To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
    terraform apply "tf.plan" ```